# ParameterDownloadOptions Class

---
An option class used for downloading parameters from the Parameters Service.
SystemObject Autodesk.Revit.DBParameterDownloadOptions
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class ParameterDownloadOptions : IDisposable

    Public Class ParameterDownloadOptions
    	Implements IDisposable

    public ref class ParameterDownloadOptions : IDisposable

    type ParameterDownloadOptions =
        class
            interface IDisposable
        end
The ParameterDownloadOptions type exposes the following members.
| Name| Description
---|---|---
| ParameterDownloadOptions|  Default constructor.
| ParameterDownloadOptions(ISetElementId, Boolean, Boolean, ForgeTypeId)| Initializes a new instance of the ParameterDownloadOptions class
Top
| Name| Description
---|---|---
| IsInstance|  True if binding to Element instances, false if binding to Element types.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| Visible|  True if the parameter is visible to the user, false if it is hidden and accessible only via the API.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the ParameterDownloadOptions
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetCategories|  Get categories for binding.
| GetGroupTypeId|  Get properties palette group identifier.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetCategories|
| SetGroupTypeId|  Set properties palette group identifier.
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB Namespace